app/views/admin/events/index.html.slim

                td= event.log_signature.classification.sig_class_name
                td= [event.iphdr.ip_src].pack('N').unpack('CCCC').join('.')
---
SELECT "iphdr".* FROM "iphdr" WHERE ("iphdr"."cid" = 400 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 399 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 398 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 397 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 396 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 395 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 394 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 393 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 392 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 391 AND "iphdr"."sid" = 1)