app/controllers/admin/events_controller.rb

SELECT "icmphdr".* FROM "icmphdr" WHERE ("icmphdr"."cid" = 400 AND "icmphdr"."sid" = 1 OR "icmphdr"."cid" = 399 AND "icmphdr"."sid" = 1 OR "icmphdr"."cid" = 398 AND "icmphdr"."sid" = 1 OR "icmphdr"."cid" = 397 AND "icmphdr"."sid" = 1 OR "icmphdr"."cid" = 396 AND "icmphdr"."sid" = 1 OR "icmphdr"."cid" = 395 AND "icmphdr"."sid" = 1 OR "icmphdr"."cid" = 394 AND "icmphdr"."sid" = 1 OR "icmphdr"."cid" = 393 AND "icmphdr"."sid" = 1 OR "icmphdr"."cid" = 392 AND "icmphdr"."sid" = 1 OR "icmphdr"."cid" = 391 AND "icmphdr"."sid" = 1)
SELECT "iphdr".* FROM "iphdr" WHERE ("iphdr"."cid" = 400 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 399 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 398 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 397 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 396 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 395 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 394 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 393 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 392 AND "iphdr"."sid" = 1 OR "iphdr"."cid" = 391 AND "iphdr"."sid" = 1)
SELECT "tcphdr".* FROM "tcphdr" WHERE ("tcphdr"."cid" = 400 AND "tcphdr"."sid" = 1 OR "tcphdr"."cid" = 399 AND "tcphdr"."sid" = 1 OR "tcphdr"."cid" = 398 AND "tcphdr"."sid" = 1 OR "tcphdr"."cid" = 397 AND "tcphdr"."sid" = 1 OR "tcphdr"."cid" = 396 AND "tcphdr"."sid" = 1 OR "tcphdr"."cid" = 395 AND "tcphdr"."sid" = 1 OR "tcphdr"."cid" = 394 AND "tcphdr"."sid" = 1 OR "tcphdr"."cid" = 393 AND "tcphdr"."sid" = 1 OR "tcphdr"."cid" = 392 AND "tcphdr"."sid" = 1 OR "tcphdr"."cid" = 391 AND "tcphdr"."sid" = 1)
---
    def index
      @events = paging Event.includes(:iphdr, :icmphdr, :tcphdr).all