app/controllers/admin/events_controller.rb

    def index
      @events = paging Event.includes(:iphdr, :icmphdr, :tcphdr, :data).all.order(timestamp: :desc)
---
SELECT "event".* FROM "event" ORDER BY "event"."timestamp" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]