app/controllers/admin/roles_controller.rb

    def set_permissions
      @permissions = Permission.order(created_at: :asc).group_by(&:subject_class)
---
SELECT "permissions".* FROM "permissions" ORDER BY "permissions"."created_at" ASC