app/controllers/admin/snort_rules_controller.rb

    def index
      @rules = paging SnortRule.all.order(created_at: :desc)
---
SELECT "snort_rules".* FROM "snort_rules" ORDER BY "snort_rules"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

    def create
      error_msg = ""
      @rule = SnortRuleForm.new(rule_params)

      if @rule.valid?
        begin
          ActiveRecord::Base.transaction do
            @rule = SnortRule.create(rule_params)
---
INSERT INTO "snort_rules" ("action", "protocol", "src_address", "src_port", "direction", "dest_address", "dest_port", "options", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def show
      @rule = SnortRule.find_by_id(params[:id])
---
SELECT "snort_rules".* FROM "snort_rules" WHERE "snort_rules"."id" = $1 LIMIT $2  [["id", 77], ["LIMIT", 1]]

    def edit
      @rule = SnortRule.find_by_id(params[:id])
---
SELECT "snort_rules".* FROM "snort_rules" WHERE "snort_rules"."id" = $1 LIMIT $2  [["id", 77], ["LIMIT", 1]]

    def update
      error_msg = ""
      @rule = SnortRule.find_by_id(params[:id])

      begin
        ActiveRecord::Base.transaction do
          @rule.update(rule_params)
---
SELECT "snort_rules".* FROM "snort_rules" WHERE "snort_rules"."id" = $1 LIMIT $2  [["id", 77], ["LIMIT", 1]]
UPDATE "snort_rules" SET "options" = $1, "updated_at" = $2 WHERE "snort_rules"."id" = $3  [["options", "(msg:\"ICMP test dkm\"; GID:1; sid:10000001; rev:001; classtype:icmp-event;)\r\n"], ["updated_at", "2021-03-27 10:09:43.283147"], ["id", 82]]

    def restart_snort
      error_msg = SnortApiService::RestartSnort.new.execute

      if error_msg == ""
        flash[:success] = "Restart successfully!"
        @rules = paging SnortRule.all
---
SELECT "snort_rules".* FROM "snort_rules" ORDER BY "snort_rules"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]