app/controllers/admin/users_controller.rb

    def index
      @users = paging User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]